j_rb_api/app/controllers/api/v1/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def index
    render json: { companies: Company.all }, except: [:id, :created_at, :updated_at]

INSERT INTO "companies" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Malta"], ["location", "Minsk"], ["created_at", "2022-11-11 10:23:03.375667"], ["updated_at", "2022-11-11 10:23:03.375667"]]
---
  def create
    @company = Company.new(company_params)
    if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_company
    if params[:company_id]
      params[:id] = params[:company_id]
    end
    @company = Company.find(params[:id])