j_graphql/app/graphql/types/mutation_type.rb

INSERT INTO "resorts" ("name", "email", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "TestDummy"], ["email", "test@mail.com"], ["description", "test"], ["created_at", "2022-11-17 20:42:04.867694"], ["updated_at", "2022-11-17 20:42:04.867694"]]
---
    def create_resort(name:, email:, description:)
      new_resort = Resort.create(name: name, email: email, description: description)