j_graphql/app/graphql/types/query_type.rb

    def resort(id:)
      Resort.find(id)
---
SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]